/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   dummy_test.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: miyuu <miyuu@student.42.fr>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/05/13 20:23:59 by miyuu             #+#    #+#             */
/*   Updated: 2025/05/14 17:14:43 by miyuu            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>

int	main(void)
{
	printf("単体テストを行いたいファイルを指定してください\n");
	printf("make test ファイル名\n");
	printf("例) \n");
	printf("make test load/normalize_cubdata_test.c\n");
	return (0);
}
